In [1]:
%matplotlib inline
import pandas as pd

In [2]:
cast = pd.read_csv('D:/Data Science/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [3]:
data = cast.copy()
data

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
...,...,...,...,...,...,...
3611207,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3611208,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3611209,Skammdegi,1985,Dalla ??r?ard?ttir,actress,Hj?krunarkona,9.0
3611210,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3611211,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3611212 entries, 0 to 3611211
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   title      object
 1   year       int64
 2   name       object
 3   type       object
 4   character  object
 5   n          float64
dtypes: float64(1), int64(1), object(4)
memory usage: 165.3+ MB

### How many movies are listed in the titles dataframe?

In [4]:
data['title'].count()

3611212

### What are the earliest two films listed in the titles dataframe?

In [10]:
data.sort_values('year').head(2)

,title,year,name,type,character,n
2514470,Miss Jerry,1894,Blanche Bayliss,actress,Miss Geraldine Holbrook (Miss Jerry),NaN
555929,Miss Jerry,1894,Chauncey Depew,actor,Himself - the Director of the New York Central...,NaN

### How many movies have the title "Hamlet"?

In [11]:
d1 = data['title'].str.startswith('Hamlet')
d1sum = d1.sum()
print(d1sum)

724

### How many movies are titled "North by Northwest"?

In [12]:
d2 = data['title'].str.startswith("North by Northwest")
d2sum = d2.sum()
d2sum

112

### When was the first movie titled "Hamlet" made?

In [20]:
d3 = data[d1].sort_values('year').head(1)
d3

          title  year               name   type character   n
1545289  Hamlet  1910  Jean Mounet-Sully  actor    Hamlet NaN

### List all of the "Treasure Island" movies from earliest to most recent.

In [21]:
d4 = data[data['title'].str.startswith('Treasure Island')].sort_values('year')

In [22]:
d4

,title,year,name,type,character,n
3553298,Treasure Island,1918,Eleanor Washington,actress,Prologue Player,NaN
1715014,Treasure Island,1918,Lloyd Perl,actor,Black Dog,4.0
830114,Treasure Island,1918,Charles Gorman,actor,Prologue Player,NaN
3298306,Treasure Island,1918,Violet Radcliffe,actress,Long John Silver,3.0
840745,Treasure Island,1918,Joe Grant,actor,Undetermined child role,NaN
...,...,...,...,...,...,...
2263036,Treasure Island Kids: The Mystery of Treasure ...,2006,Nicko Vella,actor,Charlie,NaN
2263035,Treasure Island Kids: The Monster of Treasure ...,2006,Nicko Vella,actor,Charlie,1.0
2263034,Treasure Island Kids: The Battle of Treasure I...,2006,Nicko Vella,actor,Charlie,NaN
1013858,Treasure Island Kids: The Battle of Treasure I...,2006,Jack Hurst,actor,Tyler,NaN
3583837,Treasure Island Kids: The Mystery of Treasure ...,2006,Devon Wood,actress,Barbara,NaN

### How many movies were made in the year 1950?

In [39]:
d5 = data[data['year']== 1950]

In [41]:
d5sum = d5.shape[0]
d5sum

22006

### How many movies were made in the year 1960?

In [42]:
d6 = data[data['year']== 1960]
d6sum = d6.shape[0]
d6sum

18456

### How many movies were made from 1950 through 1959?

In [48]:
d7 = data[(data['year'] >= 1950) & (data['year']<= 1959)]
d7sum = d7.shape[0]
d7sum

210986

### In what years has a movie titled "Batman" been released?

In [52]:
d8 = data[data['title'].str.startswith('Batman')]
d8.sort_values('year')
d8['year']

1026       1967
1027       1967
4281       2016
11311      2016
14827      1966
           ...
3563533    2012
3563534    2012
3583648    2016
3586919    2016
3597620    1966
Name: year, Length: 1204, dtype: int64

### How many roles were there in the movie "Inception"?

In [56]:
d9 = data[data['title']=='Inception']
d9.shape[0]

77

In [58]:
d9

,title,year,name,type,character,n
94333,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
143138,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
176819,Inception,2010,Tom Berenger,actor,Browning,8.0
190249,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
250191,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3238950,Inception,2010,Ellen Page,actress,Ariadne,3.0
3292669,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3319073,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3325768,Inception,2010,Talulah Riley,actress,Blonde,25.0
3560127,Inception,2010,Shannon Welles,actress,Old Mal,51.0

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [65]:
d10 = data[data['title']=='Inception']
d10na = d10['n'].isna()
d10sum = d10na.sum()
d10sum

26

### But how many roles in the movie "Inception" did receive an "n" value?

In [66]:
d11notna = d10['n'].notnull()
d11sum = d11notna.sum()
d11sum

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [74]:
d12 = data[data['title']=='North by Northwest']
d12n = d12[['name', 'n']]
d12drop = d12n.dropna()
d12drop.sort_values('n')

                         name     n
840374             Cary Grant   1.0
3361396       Eva Marie Saint   2.0
1404704           James Mason   3.0
3024085   Jessie Royce Landis   4.0
343701         Leo G. Carroll   5.0
2923056  Josephine Hutchinson   6.0
1634552           Philip Ober   7.0
1229083         Martin Landau   8.0
2357939         Adam Williams   9.0
1746383          Edward Platt  10.0
642085      Robert Ellenstein  11.0
2212083          Les Tremayne  12.0
447893        Philip Coolidge  13.0
1454363         Patrick McVey  14.0
198496           Edward Binns  15.0
1334726             Ken Lynch  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [96]:
d13 = data[(data['title'].str.startswith('Sleuth')) & (data['year']==1972)]
d13.sort_values('n')['name']

1644328      Laurence Olivier
314691          Michael Caine
360365         Alec Cawthorne
1412647    John (II) Matthews
2619278    Eve (III) Channing
1396572          Teddy Martin
Name: name, dtype: object

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [97]:
d14 = data[(data['title'].str.startswith('Sleuth')) & (data['year']==2007)]
d14.sort_values('n')['name']

314692           Michael Caine
1246855               Jude Law
1741124          Harold Pinter
250297         Kenneth Branagh
360366     Alec (II) Cawthorne
2619277      Eve (II) Channing
3223502      Carmel O'Sullivan
Name: name, dtype: object

### How many roles were credited in the silent 1921 version of Hamlet?

In [104]:
d15 = data[(data['title'].str.startswith('Hamlet')) & (data['year']==1921)]
d15['character'].count()

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [107]:
d16 = data[(data['title'].str.startswith('Hamlet')) & (data['year']==1996)]
d16['character'].count()

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [112]:
d17 = data['character'].str.startswith('Hamlet')
d17.sum()

120

In [ ]:
data

### How many people have played an "Ophelia"?

In [114]:
d18 = data['character'].str.startswith('Ophelia')
d18.sum()

142

### How many people have played a role called "The Dude"?

In [115]:
d19 = data['character'].str.startswith('The Dude')
d19.sum()

22

### How many people have played a role called "The Stranger"?

In [116]:
d20 = data['character'].str.startswith('The Stranger')
d20.sum()

219

### How many roles has Sidney Poitier played throughout his career?

In [117]:
d20 = data['name'].str.startswith('Sidney Poitier')
d20.sum()

43

### How many roles has Judi Dench played?

In [118]:
d20 = data['name'].str.startswith('Judi Dench')
d20.sum()

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [122]:
d21 = data[(data['name'].str.startswith('Cary Grant'))& (data['year']>=1940) & (data['year']<1950) & (data['n']==2)]
d21.sort_values('year')

                   title  year        name   type    character    n
840371  My Favorite Wife  1940  Cary Grant  actor         Nick  2.0
840381    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [123]:
d22 = data[(data['name'].str.startswith('Cary Grant'))& (data['year']>=1940) & (data['year']<1950)]
d22.sort_values('year')

,title,year,name,type,character,n
840399,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
840397,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
840353,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
840371,My Favorite Wife,1940,Cary Grant,actor,Nick,2.0
840386,Suspicion,1941,Cary Grant,actor,Johnnie,1.0
840381,Penny Serenade,1941,Cary Grant,actor,Roger Adams,2.0
840401,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
840377,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
840344,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
840369,Mr. Lucky,1943,Cary Grant,actor,Joe Adams,1.0
840370,Mr. Lucky,1943,Cary Grant,actor,Joe Bascopolous,1.0
840336,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
840378,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
840373,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
840351,George White's Scandals,1945,Cary Grant,actor,Cary Grant,NaN
840372,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
840375,Notorious,1946,Cary Grant,actor,Devlin,1.0
840415,Without Reservations,1946,Cary Grant,actor,Cary Grant,NaN
840393,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
840394,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
840368,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
840348,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
840357,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [126]:
d23 = ((data['type']=='actor') & (data['year']>=1950) & (data['year']<1960))
d23.sum()

154727

### How many roles were available for actresses in the 1950s?

In [127]:
d24 = ((data['type']=='actress') & (data['year']>=1950) & (data['year']<1960))
d24.sum()

56259

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [128]:
d25 = ((data['n']==1)& (data['year']<=1980))
d25.sum()

63924

### How many non-leading roles were available through from the beginning of film history through 1980?

In [133]:
d26 = data['year']<=1980
d26.sum()

1158704

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [136]:
d27 = data[data['year']<=1980]
d27 = d27['n'].isna()
d27.sum()

438086